0.1.0/tutorials/incompressible/pimple/pitz_daily/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-pimple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         1;
deltaT          0.0001;
writeControl    adjustableRunTime;
writeInterval   0.001;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           5;

// vim: set ft=foam et sw=2 ts=2 sts=2:
