0.1.0/tutorials/incompressible/pimple/pitz_daily/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
  grad(p)         Gauss linear;
  grad(U)         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss linearUpwind grad(U);
  div(phi,k)      bounded Gauss upwind;
  div(phi,epsilon) bounded Gauss upwind;
  div(phi,R)      bounded Gauss upwind;
  div(R)          Gauss linear;
  div(phi,nuTilda) bounded Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         none;
  laplacian(nuEff,U) Gauss linear corrected;
  laplacian(rAUf,p)  Gauss linear corrected;
  laplacian(DkEff,k) Gauss linear corrected;
  laplacian(DepsilonEff,epsilon) Gauss linear corrected;
  laplacian(DREff,R) Gauss linear corrected;
  laplacian(DnuTildaEff,nuTilda) Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
  interpolate(U)  linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
